aboutMe/summary2016.org
#+TITLE: 2016总结
* 概述
2016年过去了，2017年已经开始，本文档主要涉及对2016年的总结以及对2017年的展望。
* 2016总结
** 收获
*** 技术
1. Hadoop生态圈里的工具基本会用，并对其有了一定程度的认识（hdfs，mapreduce，yarn，spark，hbase，flume，kafka，zookeeper）
2. 使用Scala语言编写Spark程序
3. 对ElasticSearch有了更加深入的了解和应用，引入Kibana，Logstash
4. 引入streaming，解决数据实时处理问题
5. 引入kafka，解决海量消息的转发
6. 引入maven，规范了公司的Java编程
7. 引入springboot，规范了编程框架
8. 引入gitlab，替换公司原有的cvs
9. 对mllib中的部分算法有了初步了解
10. 坚持用emacs+org-mode写文档，用org-twbs导出更漂亮的html
*** 生活
1. 一定程度上认识了自己
2. 对情感有了一定的控制能力
3. 对广州这座城市有了新的认识
4. 交了很多新朋友，老郭，波总，火山哥，志璋，阿ben，妹姐，丽姐……
5. 见到了李伟
6. 学会了面对寂寞
*** 遗憾
1. 陪孩子的时间很少
2. 没有学会吉他
*** 留给2016年的一句话
祝：H...幸福快乐，不要忘记24年的约定。
* 2017展望
1. 将scala玩明白，应用到工程中
2. 保持对技术的兴趣，深度和广度同时推进
3. 规划每天的时间安排，不可虚度
4. 学会玩吉他
5. 见一次李伟
6. 再买辆车
7. 拍些照片
8. 保持对H...的热爱
9. 交新朋友
