aboutMe/summary2016.html
<!doctype html>
<html lang="en">
<head>
<title>2016总结</title>
<!-- 2017-01-23 Mon 16:18 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="赵光建">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">2016总结</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
2016年过去了，2017年已经开始，本文档主要涉及对2016年的总结以及对2017年的展望。
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 2016总结</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 收获</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> 技术</h4>
<div class="outline-text-4" id="text-2-1-1">
<ol class="org-ol">
<li>Hadoop生态圈里的工具基本会用，并对其有了一定程度的认识（hdfs，mapreduce，yarn，spark，hbase，flume，kafka，zookeeper）
</li>
<li>使用Scala语言编写Spark程序
</li>
<li>对ElasticSearch有了更加深入的了解和应用，引入Kibana，Logstash
</li>
<li>引入streaming，解决数据实时处理问题
</li>
<li>引入kafka，解决海量消息的转发
</li>
<li>引入maven，规范了公司的Java编程
</li>
<li>引入springboot，规范了编程框架
</li>
<li>引入gitlab，替换公司原有的cvs
</li>
<li>对mllib中的部分算法有了初步了解
</li>
<li>坚持用emacs+org-mode写文档，用org-twbs导出更漂亮的html
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> 生活</h4>
<div class="outline-text-4" id="text-2-1-2">
<ol class="org-ol">
<li>一定程度上认识了自己
</li>
<li>对情感有了一定的控制能力
</li>
<li>对广州这座城市有了新的认识
</li>
<li>交了很多新朋友，老郭，波总，火山哥，志璋，阿ben，妹姐，丽姐……
</li>
<li>见到了李伟
</li>
<li>学会了面对寂寞
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> 遗憾</h4>
<div class="outline-text-4" id="text-2-1-3">
<ol class="org-ol">
<li>陪孩子的时间很少
</li>
<li>没有学会吉他
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> 留给2016年的一句话</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
祝：H&#x2026;幸福快乐，不要忘记24年的约定。
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 2017展望</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>将scala玩明白，应用到工程中
</li>
<li>保持对技术的兴趣，深度和广度同时推进
</li>
<li>规划每天的时间安排，不可虚度
</li>
<li>学会玩吉他
</li>
<li>见一次李伟
</li>
<li>再买辆车
</li>
<li>拍些照片
</li>
<li>保持对H&#x2026;的热爱
</li>
<li>交新朋友
</li>
</ol>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. 概述</a></li>
<li><a href="#sec-2">2. 2016总结</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. 收获</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 2017展望</a></li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: 赵光建</p>
<p class="date">Created: 2017-01-23 Mon 16:18</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org-mode</a> 8.2.10)</p>
</div>
</footer>
</body>
</html>
